{
  "contents": [
    {
      "suggestion": "Bomber Ranger | <@249328472265195521> | 04 - 02 - 2021 | 1\nA ranger subclass that does pitiful direct damage, but relies on stacking debuffs (similar to nebula set's bonus buffs) and manual detonation for damage, with bonuses for pulling off longer chains of detonations. Think of it as planting multiple bombs, then pushing the plunger",
      "id": 1
    },
    {
      "suggestion": "Special Death Animations | <@402246856752627713> | 04 - 02 - 2021 | 2\nSpecial death animations for bosses and minibosses.",
      "id": 2
    },
    {
      "suggestion": "Material Names | <@402246856752627713> | 04 - 02 - 2021 | 3\n• Twisted Energy • Elemental Weave • Soul Essence • Soul Weave",
      "id": 3
    },
    {
      "suggestion": "Icicle Glaive | <@402246856752627713> | 04 - 02 - 2021 | 4\nA spear which shoots snow cave icicles when you attack.",
      "id": 4
    },
    {
      "suggestion": "Hemomancy Cleric | <@402246856752627713> | 04 - 02 - 2021 | 5\nA system where you collect blood from enemies via damaging them with melee weapons, and use that to empower your magic.",
      "id": 5
    },
    {
      "suggestion": "undefined | <@331912877340622858> | 04 - 02 - 2021 | 6\nundefined",
      "id": 6
    },
    {
      "suggestion": "Tomb stone | <@402246856752627713> | 04 - 02 - 2021 | 7\na placeable object that summons a zombie with slightly boosted stats to fight for you - Terry",
      "id": 7
    },
    {
      "suggestion": "undefined | <@331912877340622858> | 04 - 02 - 2021 | 8\nundefined",
      "id": 8
    },
    {
      "suggestion": "Grave Robber | <@117819195432894466> | 04 - 02 - 2021 | 9\nBoss gimmick that detects and gains a stacking buff from nearby tombstones. Punishes players who do not clean after their deaths. Maybe when spawned, it throws out a few generic tombstones. Bonus reward when killed with more Tombstone buffs, like players who want to scale their farming.",
      "id": 9
    },
    {
      "suggestion": "Hail Fire Spell | <@249328472265195521> | 06 - 02 - 2021 | 10\nshoots one large but slow projectile, and that fires a swarm of smaller projectiles, ends upon the main part hitting a enemy or wall",
      "id": 10
    },
    {
      "suggestion": "Pet Merchant | <@249328472265195521> | 06 - 02 - 2021 | 11\nNPC vendor who unlocks pet versions of bosses you defeat.  Hilarious when you start defeating archangels and old gods!",
      "id": 11
    },
    {
      "suggestion": "Pet Merchant | <@402246856752627713> | 06 - 02 - 2021 | 12\nNPC vendor who unlocks pet versions of bosses you defeat.  Hilarious when you start defeating archangels and old gods!",
      "id": 12
    },
    {
      "suggestion": "flailing flail | <@331912877340622858> | 06 - 02 - 2021 | 13\na flail with smaller flails",
      "id": 13
    },
    {
      "suggestion": "flail of flails | <@331912877340622858> | 06 - 02 - 2021 | 14\na flail with smaller flails at the end",
      "id": 14
    },
    {
      "suggestion": "Lore NPCs | <@117819195432894466> | 06 - 02 - 2021 | 15\nIn order to breathe more life into the lore, or existence of other races or kingdom reps, have some 'lesser NPCs' capable of joining up.  Instead of selling items, they could have extra dialogue options to casually talk about this topic or that.",
      "id": 15
    },
    {
      "suggestion": "Pet Merchant | <@117819195432894466> | 06 - 02 - 2021 | 16\nNPC vendor who unlocks pet versions of bosses you defeat.  Hilarious when you start defeating archangels and old gods!",
      "id": 16
    },
    {
      "suggestion": "library of swords | <@331912877340622858> | 06 - 02 - 2021 | 17\na channels magic spell that summons and shoots sword towards the cursor, could have higher lvl variants with nice and more swords",
      "id": 17
    },
    {
      "suggestion": "Party Popper Gun | <@117819195432894466> | 06 - 02 - 2021 | 18\nMore uses for the confetti graphic, possible to upgrade to a cannon if you want to risk it becoming a MLP ref. Possibly to cause Confusion to enemies, possibly to grant buffs to nearby allies.",
      "id": 18
    },
    {
      "suggestion": "party bomb | <@331912877340622858> | 06 - 02 - 2021 | 19\nit’s just a normal bomb but also has confetti",
      "id": 19
    },
    {
      "suggestion": "sawblade | <@331912877340622858> | 06 - 02 - 2021 | 20\na minion that’s the saw trap from the dungeon, just non hostile",
      "id": 20
    },
    {
      "suggestion": "PECK | <@117819195432894466> | 06 - 02 - 2021 | 21\nspell that deals a low damage multi-hit attack, low Mana, and zero cool down. Attack faster than you can click!",
      "id": 21
    },
    {
      "suggestion": "cape of snowfall | <@331912877340622858> | 06 - 02 - 2021 | 22\nallows a short dash with invulnerability where you turn into snow flakes",
      "id": 22
    },
    {
      "suggestion": "harpy’s yolk | <@331912877340622858> | 06 - 02 - 2021 | 23\nunder certain conditions ,perhaps like above a certain height, you turn into a harpy, ala werewolf and merfolk",
      "id": 23
    },
    {
      "suggestion": "grappler | <@331912877340622858> | 06 - 02 - 2021 | 24\na enemy who tries to grab and throw the player",
      "id": 24
    },
    {
      "suggestion": "Astral Bombardment | <@409768934196117504> | 06 - 02 - 2021 | 25\nBasically a spell which causes stuff from space to rain down on your enemies, costs a lot of mana but does a ton of damage",
      "id": 25
    },
    {
      "suggestion": "Music-based support | <@249328472265195521> | 06 - 02 - 2021 | 26\nLike a Bard or a Monster Hunter hunter with a Hunting Horn, you beat the crap out of enemies and do special supportive effects for you and your party depending on what you hit them with in which order",
      "id": 26
    },
    {
      "suggestion": "Tooltip Enhancement | <@402246856752627713> | 06 - 02 - 2021 | 27\nUse icons to our advantage when drawing Tooltips, to allow giving brief descriptions of long lists like debuff immunities",
      "id": 27
    },
    {
      "suggestion": "UI Enhancement | <@402246856752627713> | 06 - 02 - 2021 | 28\nUse icons to our advantage when enemies are afflicted with a debuff, allowing us to draw the icons of the debuffs they are inflicted with underneath their health bar to give players a brief summary of the debuffs they are afflicted with. Make this a toggleable feature",
      "id": 28
    },
    {
      "suggestion": "A new mage weapon | <@409768934196117504> | 06 - 02 - 2021 | 29\nshoots out a projectile that does damage to enemies and disappears when it comes into contact with enemies, however if it doesn't come into contact with an enemy, it will slowly return to the player, buffing them and restoring health",
      "id": 29
    },
    {
      "suggestion": "new spray fire gun | <@409768934196117504> | 06 - 02 - 2021 | 30\nthis gun sprays out bullets in a cone looking pattern. The longer you shoot, the cone shape gets smaller until it's just a precise line of bullets being fired. As the cone games smaller, damage and crit chances are increased",
      "id": 30
    },
    {
      "suggestion": "a fan | <@409768934196117504> | 06 - 02 - 2021 | 31\na fan item that players can hold and activate. Activating the fan while holding it will cause the player to slowly move backwards. I can't think of a practical use, but it could be an interesting and unique item",
      "id": 31
    },
    {
      "suggestion": "Druid circle spell | <@331912877340622858> | 06 - 02 - 2021 | 32\nhas the Druids circle but if a friend gets hurt it heals, and if a enemy enters the circle it gets hurt, high mana upkeep, but strong",
      "id": 32
    },
    {
      "suggestion": "more useful mounts | <@409768934196117504> | 06 - 02 - 2021 | 33\nmounts that have weapons. Not meant to be something to fight bosses with but just making getting around the world a bit easier. It could be anything from a dragon that breaths fire to a mech with lazers",
      "id": 33
    },
    {
      "suggestion": "Blueprint Mode | <@409768934196117504> | 06 - 02 - 2021 | 34\nA way to place down \"blueprint blocks\" which allow you to plan out your builds before fully making them, a lot like the blueprints in factorio in a way but not really",
      "id": 34
    },
    {
      "suggestion": "coolicorm | <@331912877340622858> | 06 - 02 - 2021 | 35\nit’s a unicorn with a cigar sunglasses, and a chain gun on its side, and when mounted it auto fires at things in front of it for okayish damage",
      "id": 35
    },
    {
      "suggestion": "Vampiric Weapons | <@409768934196117504> | 06 - 02 - 2021 | 36\nAlt title, blood weapons. Basically a vampire knives equivalent for each class. A sword that heals, a spell that heals, a gun that heals *cough* red death *cough*, etc",
      "id": 36
    },
    {
      "suggestion": "vampires fang | <@331912877340622858> | 06 - 02 - 2021 | 37\naccessory, gives low power version of vampire knife life steal",
      "id": 37
    },
    {
      "suggestion": "can of energy drink | <@409768934196117504> | 06 - 02 - 2021 | 38\nthis accessory gives you a speed boost as long as you have it equipped, designed to be found in wooden chests during early prehardmode",
      "id": 38
    },
    {
      "suggestion": "boink nuclear drink | <@331912877340622858> | 06 - 02 - 2021 | 39\ndoubles damage you do, but could double or triple damage taken",
      "id": 39
    },
    {
      "suggestion": "Bounty/NPC giver | <@409768934196117504> | 06 - 02 - 2021 | 40\nAdds bounties, short fetch quests, for each NPC. They reset in-game daily and give varying rewards based on the difficulty of the quest. As more NPCs are unlocked, the earlier NPCs also get new quests. This'll just be to make sure that players won't completely ignore the earlier NPCs in lategame. There could be a vendor that tracks how many you've done and depending on how many you've done, his inventory of items to sell will get bigger and bigger.",
      "id": 40
    },
    {
      "suggestion": "fisher vendor | <@331912877340622858> | 06 - 02 - 2021 | 41\nhave a way to get some more rng fishing g rewards also be able to be bought for crazy high rates",
      "id": 41
    },
    {
      "suggestion": "Blood Vial | <@402246856752627713> | 08 - 02 - 2021 | 42\nBlood potions, potentially to restore Blood for Blood Clerics in the same way that Mana potions restore Mana for Mages. Inflicts Blood Sickness",
      "id": 42
    },
    {
      "suggestion": "blood | <@331912877340622858> | 08 - 02 - 2021 | 43\na liquid faster than lava, slower than water, could give regen to so,e monsters",
      "id": 43
    },
    {
      "suggestion": "Material | <@402246856752627713> | 08 - 02 - 2021 | 44\nSilk combined with Fallen Stars at a Starloom make Starfiber. Starfiber combined with one of each soul at a hardmode anvil makes Soulweave",
      "id": 44
    },
    {
      "suggestion": "Elemental Display | <@402246856752627713> | 08 - 02 - 2021 | 45\nShow the elemental types of enemies next to or underneath their health bars, or on mouseover next to their name.",
      "id": 45
    },
    {
      "suggestion": "sippy cup potions | <@331912877340622858> | 08 - 02 - 2021 | 46\na joke item that restores less than the default potions",
      "id": 46
    },
    {
      "suggestion": "mercury rain | <@331912877340622858> | 08 - 02 - 2021 | 47\nkinda like golden shower but less cringe and more melting flesh, I think it does that?",
      "id": 47
    },
    {
      "suggestion": "Trials Of Lysanderia | <@409768934196117504> | 12 - 02 - 2021 | 48\nI can't remember how to spell her name. An ultra hardcore mode, not sure how we could flesh it out and make it unique tho",
      "id": 48
    },
    {
      "suggestion": "risk of rockets | <@331912877340622858> | 12 - 02 - 2021 | 49\na accessory that which each attack has a chance to span a missile that seeks and damages a enemy, kinda like the risk of rain missile launcher",
      "id": 49
    },
    {
      "suggestion": "Catastrophe Mode | <@117819195432894466> | 12 - 02 - 2021 | 50\nA scroll that gives a temp effect to add a bunch zeros to the displayed damage numbers dealt and received. Cosmetic.",
      "id": 50
    },
    {
      "suggestion": "spitter slime | <@331912877340622858> | 12 - 02 - 2021 | 51\nit spits a glob of slime and if it misses, a normal slime spawns, the spitter is pretty immobile",
      "id": 51
    },
    {
      "suggestion": "Blast-Assisted Weapons | <@249328472265195521> | 16 - 02 - 2021 | 52\nBasic true-melee weaponry that is enhanced through the power of magitek, swinging faster and harder thanks to explosive caps designed to assist the swing",
      "id": 52
    },
    {
      "suggestion": "Nekomancer | <@331912877340622858> | 16 - 02 - 2021 | 53\na simple robed guy with cat ears, summons cats, possibly slime cats, until it dies,cats are low up amid damage impact enemy",
      "id": 53
    },
    {
      "suggestion": "Game Stage NPC Relevance | <@402246856752627713> | 19 - 02 - 2021 | 54\nWe should make enemy NPC's remain relevant to the game stage. When you're in prehardmode, you're only ever assaulted by zombies and demon eyes in the purity. In hardmode, this expands to include wandering eyes and possessed armor. We should maintain this pattern so that enemy NPC's maintain relevance to the power of the player and the development of the world.",
      "id": 54
    },
    {
      "suggestion": "Blood Refill Item | <@402246856752627713> | 19 - 02 - 2021 | 55\nJust like being a mage and having depleted Mana will make enemies drop Mana stars on kill, killing an enemy as a Blood Cleric will drop blood that you can pick up.",
      "id": 55
    },
    {
      "suggestion": "Vampire Statue | <@117819195432894466> | 19 - 02 - 2021 | 56\nIn the same VEIN as heart statue and star statue, this one just drops blood when powered",
      "id": 56
    },
    {
      "suggestion": "petcro | <@331912877340622858> | 19 - 02 - 2021 | 57\na vanity item that is just Velcro and has your pet stick to your back",
      "id": 57
    },
    {
      "suggestion": "pet backpack | <@331912877340622858> | 19 - 02 - 2021 | 58\nsame as the pet velcro, but they are inside one of those cat backpacks",
      "id": 58
    },
    {
      "suggestion": "Brimstone | <@402246856752627713> | 21 - 02 - 2021 | 59\nAn alternative to crystal which spawns in the underworld in Hardmode.",
      "id": 59
    },
    {
      "suggestion": "chibstal | <@331912877340622858> | 21 - 02 - 2021 | 60\na pet based on chibi crystal",
      "id": 60
    },
    {
      "suggestion": "Historian | <@117819195432894466> | 21 - 02 - 2021 | 61\nNPC who can be given items like The Guide, but instead of listing recipes, they give it expanded flavor text",
      "id": 61
    },
    {
      "suggestion": "guides avenger  | <@331912877340622858> | 21 - 02 - 2021 | 62\na prehsrdmode enemy who only spawn 2 days within the guide dying",
      "id": 62
    },
    {
      "suggestion": "aura of malice | <@331912877340622858> | 22 - 02 - 2021 | 63\ncuts your hp by half, but deals massive damage to any enemy in your aura",
      "id": 63
    },
    {
      "suggestion": "aura of mastery | <@331912877340622858> | 22 - 02 - 2021 | 64\ncuts/possibly removes your mana but boosts the damage of all friendly characters in the radius but a large amount",
      "id": 64
    },
    {
      "suggestion": "Material | <@402246856752627713> | 22 - 02 - 2021 | 65\nCombine Elemental Essence with Ectoplasm to create am Elemental Catalyst of the same type as the Essence used to craft it. Combine Elemental Catalysts of opposing elemental types to get Chaos Relics. Mix Chaos Relics with Lunar Fragments to create Lunar Relics of the same type as the fragment used to craft it.",
      "id": 65
    },
    {
      "suggestion": "flailsaw | <@331912877340622858> | 23 - 02 - 2021 | 66\na flail that when thrown, moves erratically around and causes bleed damage",
      "id": 66
    },
    {
      "suggestion": "spikes flail saw | <@331912877340622858> | 23 - 02 - 2021 | 67\nsame as flail saw, but extends spikes that spin for extra range",
      "id": 67
    },
    {
      "suggestion": "krelmongus the destroyer | <@331912877340622858> | 24 - 02 - 2021 | 68\na possible boss, a huge crab who’s claws kk da wander around like skeletron, possibly has smaller crabs on his back to shoot foam for a ranged attack",
      "id": 68
    },
    {
      "suggestion": "super mecha rocket fist | <@331912877340622858> | 25 - 02 - 2021 | 69\nit is a boomerangs type weapon but it’s a fist with a rocket that flies in a arc, possibly extra knock back damage?",
      "id": 69
    },
    {
      "suggestion": "Material | <@402246856752627713> | 05 - 03 - 2021 | 70\nAquatic Crystal or Briny Crystal. \"A fossilized scale from an ancient aquatic titan.\"",
      "id": 70
    },
    {
      "suggestion": "Spirit of Harmony | <@402246856752627713> | 08 - 03 - 2021 | 71\nA summon for the Cleric class that will act as a secondary support unit, sticking close to the most hurt player nearby and healing them. This idea is repeatable, allowing effective use of auras, rendering the Cleric class more effective. This also gives it a lot of incentive to be played in multiplayer groups.",
      "id": 71
    },
    {
      "suggestion": "healing bonker | <@331912877340622858> | 08 - 03 - 2021 | 72\na mace that deals no damage but heals friends",
      "id": 72
    },
    {
      "suggestion": "chaplains “sidearm | <@331912877340622858> | 08 - 03 - 2021 | 73\na mace with very high knock back, has a alt attack to deal a low damage aoe when on the ground",
      "id": 73
    },
    {
      "suggestion": "changeling blade | <@331912877340622858> | 08 - 03 - 2021 | 74\nstarts off  as a sword, right click shifts it between modes, a spell and a gun",
      "id": 74
    },
    {
      "suggestion": "h.e.f. | <@331912877340622858> | 08 - 03 - 2021 | 75\nhighly explosive flail, when thrown out it shoots out a swarm of tracking rockets, when held it shoots them over time",
      "id": 75
    },
    {
      "suggestion": "clerics might | <@331912877340622858> | 08 - 03 - 2021 | 76\na flail that radiates radiant damage, possibly holy bolts, when actively thrown",
      "id": 76
    },
    {
      "suggestion": "gravitronifkcation gun | <@331912877340622858> | 08 - 03 - 2021 | 77\nshoots a non damaging black hole that draws in slower projectiles and smaller enemies, possibly draws mana while active",
      "id": 77
    },
    {
      "suggestion": "wizard breaker | <@331912877340622858> | 08 - 03 - 2021 | 78\na pvp oriented melee weapon that deal moderate damage, but also either drains mana or increases mana costs",
      "id": 78
    },
    {
      "suggestion": "engineers magnum opus | <@331912877340622858> | 08 - 03 - 2021 | 79\na mount that’s a train, high left to right speed, has a run up time, and short jump, possibly deals damage when running into stuff",
      "id": 79
    },
    {
      "suggestion": "shotflail | <@331912877340622858> | 08 - 03 - 2021 | 80\na flail that is covered in shot guns, that randomly fire",
      "id": 80
    },
    {
      "suggestion": "popes boomstick | <@331912877340622858> | 09 - 03 - 2021 | 81\na shotgun that relies on magic, each bullet is a small mace that can bounce once",
      "id": 81
    },
    {
      "suggestion": "Mega Bullets | <@117819195432894466> | 09 - 03 - 2021 | 82\nAmmo that has comically large graphic and hitbox. Like lemon-sized!",
      "id": 82
    },
    {
      "suggestion": "Fuzzy Bullets | <@117819195432894466> | 09 - 03 - 2021 | 83\nHas a chance to cause Confuse on enemies... maybe the Chance% or Duration based on weapon's RoF, so simply shooting more is not an absolute advantage? Dunno how to balance this concept, unless it should be based on the gun instead of the ammo x.x",
      "id": 83
    },
    {
      "suggestion": "slime class slugs | <@331912877340622858> | 09 - 03 - 2021 | 84\na bullet with high knock back and damage, hilariously slow, about the size of a slime",
      "id": 84
    },
    {
      "suggestion": "Broken Seconds | <@117819195432894466> | 09 - 03 - 2021 | 85\nAn ammo that shoots out and slows to a stop, lingering in place until touching an enemy or after a moderate duration. Perfect for area denial, or destroying invaders at a choke point",
      "id": 85
    },
    {
      "suggestion": "steel thread cape | <@331912877340622858> | 10 - 03 - 2021 | 86\na melee weapon. That when swung gives a boat to armor till you can swing again, deals minimal damage",
      "id": 86
    },
    {
      "suggestion": "yo-yo hoo | <@331912877340622858> | 11 - 03 - 2021 | 87\na pirate themed yo-yo weapon, possibly has small cutlasses spinning around it, and a little automatically firing cannon?",
      "id": 87
    },
    {
      "suggestion": "Weapon | <@402246856752627713> | 11 - 03 - 2021 | 88\nGale Boomerang. Reference to LoZTP, pulls in nearby enemies and does damage on contact.",
      "id": 88
    },
    {
      "suggestion": "giants gauntlets | <@331912877340622858> | 11 - 03 - 2021 | 89\nmakes melee weapons twice as large, twice as slow, twice the knock back, also throwing you back some, and boosted damage, could be combined with the other gauntlets",
      "id": 89
    },
    {
      "suggestion": "chakram of chakrams | <@331912877340622858> | 11 - 03 - 2021 | 90\na boomerangs type weapon that can bounce 4 times, each time shooting off 1-3 smaller chakrams bouncing once, can’t be thrown again till both the main and mini come back",
      "id": 90
    },
    {
      "suggestion": "golems gauntlets | <@331912877340622858> | 11 - 03 - 2021 | 91\na melee weapon that is a series of rapid fire punches, works like short swords so only hits left or right, but high speed and damage",
      "id": 91
    },
    {
      "suggestion": "Item | <@402246856752627713> | 11 - 03 - 2021 | 92\nShadow Sigil or Blood Sigil, made from the world evil's wood and a unique drop from world evil enemies. Will be the starting accessory for Necro Clerics, allowing them to build stacks for Necrotic",
      "id": 92
    },
    {
      "suggestion": "Item | <@402246856752627713> | 11 - 03 - 2021 | 93\nCleansing Rune. Will be made from sunplate and fallen stars. Will be the starting accessory for Radiant Clerics, allowing them to build Radiance stacks.",
      "id": 93
    },
    {
      "suggestion": "turret boss | <@331912877340622858> | 16 - 03 - 2021 | 94\na boss who when spawned creates a mini biome in the clockwork, where it’s base is the biome, would deal high damage but have slow tracking",
      "id": 94
    },
    {
      "suggestion": "elemental slimes | <@331912877340622858> | 16 - 03 - 2021 | 95\nslimes that are immune to all damage except what they are weak to, deal like one damage, intended as a kinda tutorial enemy",
      "id": 95
    },
    {
      "suggestion": "Watery Grave Debuff | <@249328472265195521> | 20 - 03 - 2021 | 96\nA debuff that forces an enemy towards the bottom of a body of liquid, even if they would normally float, like a slime.",
      "id": 96
    },
    {
      "suggestion": "Blood Crystal | <@402246856752627713> | 21 - 03 - 2021 | 97\nA semi-rare drop that drops from enemies in the Crimson",
      "id": 97
    },
    {
      "suggestion": "Writhing Core | <@402246856752627713> | 21 - 03 - 2021 | 98\nA semi-rare drop that drops from enemies in the Corruption.",
      "id": 98
    },
    {
      "suggestion": "Beginner Cleric Accessory | <@402246856752627713> | 22 - 03 - 2021 | 99\n1. Aequalis Sigil\n2. Aequalis Amulet\n3. Aequalis Rune\n4. Parity Sigil\n5. Statera Sigil\n\nAllows Clerics to switch between Radiant and Shadow stacks by consuming stacks, and allows them to begin accumulating stacks of the currently attuned element\n\nCrafted from:\nEbonwood / Shadewood, \nBlood Crystals / Writhing Cores, \nShadow Scales / Tissue Samples,\nDemonite / Crimtane\nPurification Powder,\nPurified Wood?,\nPlatinum",
      "id": 99
    },
    {
      "suggestion": "Radiant Cleric Ability | <@402246856752627713> | 22 - 03 - 2021 | 100\nSend out a wave of healing that will heal any players in range and also yourself.",
      "id": 100
    },
    {
      "suggestion": "Shadow Cleric Ability | <@402246856752627713> | 22 - 03 - 2021 | 101\nImbue the next attack that hits of each nearby player with a devastating amount of extra damage.",
      "id": 101
    },
    {
      "suggestion": "block to spell transfiguration | <@331912877340622858> | 22 - 03 - 2021 | 102\nbasic idea would be to take a blocks like blast resistance and make it real that much damage/summon that many projectiles. A example could be using one that makes block bees, with a dirt you get one",
      "id": 102
    },
    {
      "suggestion": "Barrier Tome | <@249328472265195521> | 24 - 03 - 2021 | 103\nA cleric \"weapon\" that when used provides a barrier that grants extra effective HP, nullifying direct damage",
      "id": 103
    },
    {
      "suggestion": "shield basher | <@331912877340622858> | 24 - 03 - 2021 | 104\na weapons who’s damage scales with your armor score",
      "id": 104
    },
    {
      "suggestion": "ways to improve weapons and armor | <@331912877340622858> | 24 - 03 - 2021 | 105\na big problem I have with terraria is they introduce a cool mechanic with armor or weapon, and then up you upgrade and poof, worthless",
      "id": 105
    },
    {
      "suggestion": "biome based weapons | <@331912877340622858> | 24 - 03 - 2021 | 106\na weapon or spell that changes its effect with biomes, like a gun in desert could cause a blind or a ocean spell could make a tidal wave",
      "id": 106
    },
    {
      "suggestion": "aggro item | <@249328472265195521> | 02 - 04 - 2021 | 107\nFor tanking purposes in multiplayer, an item (potion?) that grants a buff which massively increases your aggro radius and power. Saves you a slot in your accessory bar for better gear",
      "id": 107
    },
    {
      "suggestion": "Quick Build Swap | <@117819195432894466> | 03 - 04 - 2021 | 108\nA second set of accessories that you can swap to with a hotkey",
      "id": 108
    },
    {
      "suggestion": "thermite termite | <@331912877340622858> | 09 - 04 - 2021 | 109\na bug enemy that causes fire damage",
      "id": 109
    },
    {
      "suggestion": "Eater of Toes | <@117819195432894466> | 23 - 04 - 2021 | 110\nRare mob, visually resembles a scaled down version of Eater of Worlds. Could be just a rare gag, but could maybe drop se joke loot",
      "id": 110
    },
    {
      "suggestion": "deepsea merman | <@246089579982094337> | 30 - 04 - 2021 | 111\nanglerfish based mermen with massive, toothy mouths that light up a bit of area around them, like jelly fish. maybe thet drop a good glowy item?",
      "id": 111
    },
    {
      "suggestion": "Hadal Husk | <@246089579982094337> | 30 - 04 - 2021 | 112\na zombie that died underwater and has barnacles and coral all over them. can survive the deep because magic. might be nice if they dropped coral, so you didn't need to constantly grow it for gills potions.",
      "id": 112
    },
    {
      "suggestion": "Goblin Shark | <@246089579982094337> | 30 - 04 - 2021 | 113\nIt's a Goblin shark, suprisingly",
      "id": 113
    },
    {
      "suggestion": "Blobfish | <@246089579982094337> | 30 - 04 - 2021 | 114\nEssentially an underwater slime, due to their slimey nature",
      "id": 114
    },
    {
      "suggestion": "Vampire Squid | <@246089579982094337> | 30 - 04 - 2021 | 115\nsucks a minor amount of life and heals itself? probably wouldn't be too damaging, as we'd want it to be decently common. maybe they only come out at night.",
      "id": 115
    },
    {
      "suggestion": "Megalodon | <@246089579982094337> | 30 - 04 - 2021 | 116\nShark that comes out during a rain or something when you're in the open ocean, kinda like a miniboss. in the same vein as desert gaurdians or ice golems",
      "id": 116
    },
    {
      "suggestion": "Sky Scraper | <@117819195432894466> | 01 - 05 - 2021 | 117\nWorking name... anyways, a late-game 'sword' that uses the animation of the drill... as in, hold down the button to have it point towards the cursor and it damages people it comes in contact with.  But, while holding it out, it jets you in that direction.  Think of flying around while holding onto the tail end of a rocket, knocking people aside when you stab through them.  Late-game because it's basically unlimited flight, even though it's very awkward controls",
      "id": 117
    },
    {
      "suggestion": "Weapon Skins | <@117819195432894466> | 01 - 05 - 2021 | 118\nSomething like... a cosmetic slot that substitutes what is in your hands when you attack.  Maybe slots for melee, ranged, and cast...?  Might be too much to separate the different types.  Would be hilarious swinging a gun to smack badguys",
      "id": 118
    },
    {
      "suggestion": "Turrets | <@246089579982094337> | 03 - 05 - 2021 | 119\nturrets of varying sorts, Gun turrets, rocket turrets, magic turrets? would a better incentive for protecting and guarding your base, making it more of a stronghold, and a safe location, as opposed to somewhere you visit briefly to craft things. would also be helpful during events. Ideas include liming amounts withing a certain tile radius. maybe having the rocket turret shoot drilling rockets, to hit enemies that move through tile surfaces",
      "id": 119
    },
    {
      "suggestion": "The Archangels Wrath | <@246089579982094337> | 03 - 05 - 2021 | 120\nbasically you build a multiblock structure on the moon {idea pending, we don't know if we can do that} with your base, although you can do it anywhere, this would just further insentivize base building. its a late game non-magic weapon that can only be used at night, and not during a new moon, that focuses sunlight down on a target, like a downward facing last prism, as an example. it would be hard to make, but the upside, is it doesn't use mana, and is basically infinite use during the night. we can have it's power level be based on the lunar phase, as less light would be prevalent when the moon is nearing a new moon, than when it's nearing a full moon.",
      "id": 120
    },
    {
      "suggestion": "Crystal Pistol | <@402246856752627713> | 09 - 05 - 2021 | 121\nA ranged weapon that shoots crystal darts which when impacting a target explode into crystal shards that home in on the target that was hit. A better version of crystal bullets, unique to this weapon",
      "id": 121
    },
    {
      "suggestion": "Hellblaster | <@402246856752627713> | 09 - 05 - 2021 | 122\nA handgun crafted from combining the Phoenix Blaster and the Crystal Pistol. It shoots Brimstone Crystal bullets which follow the same AI as the Crystal Pistol bullets, but inflict Hellfire on the target",
      "id": 122
    },
    {
      "suggestion": "Brimstone Bullets | <@402246856752627713> | 09 - 05 - 2021 | 123\nBullets made of Brimstone Crystals. They repeat the AI of Crystal Bullets, but they inflict Hellfire on their target",
      "id": 123
    },
    {
      "suggestion": "hammer of the earth | <@246089579982094337> | 10 - 05 - 2021 | 124\na hammer, that is an actual melee weapon instead if a furteture interaction item that has a powerful, but slow left click with a ton of knockback. when you right click you slam the hammer into the ground, sending out rocky bursts to hit nearby enemies",
      "id": 124
    },
    {
      "suggestion": "Prismatic Spray Shotgun | <@402246856752627713> | 10 - 05 - 2021 | 125\nShoots 6 pellets of light that represent each element, each inflicting their own debuff. On contact with an enemy, they shoot out sparks of that element which damage any enemy they come into contact with",
      "id": 125
    },
    {
      "suggestion": "Soul Crystal : Accessory | <@402246856752627713> | 11 - 05 - 2021 | 126\nKilling enemy NPC's will grant you their soul, which is stored in this accessory up to a maximum. You can use these souls to empower yourself passively, consume them to empower yourself actively, or consume them to cast spells.",
      "id": 126
    },
    {
      "suggestion": "Snowfury | Item | Weapon | Melee | <@402246856752627713> | 11 - 05 - 2021 | 127\nA sword potentially crafted from a Starfury and some Ice elemental themed materials. Rains shards of ice down from the sky onto your mouse location.",
      "id": 127
    },
    {
      "suggestion": "Luminous Bead | Item | Pet | <@402246856752627713> | 11 - 05 - 2021 | 128\nFour tiny wisps will follow you around, occasionally spinning or flying in circles. They emit a medium amount of light.",
      "id": 128
    }
  ]
}