{
  "contents": [
    {
      "suggestion": "Bomber Ranger | <@249328472265195521> | 04 - 02 - 2021 | 1\nA ranger subclass that does pitiful direct damage, but relies on stacking debuffs (similar to nebula set's bonus buffs) and manual detonation for damage, with bonuses for pulling off longer chains of detonations. Think of it as planting multiple bombs, then pushing the plunger",
      "id": 1
    },
    {
      "suggestion": "Special Death Animations | <@402246856752627713> | 04 - 02 - 2021 | 2\nSpecial death animations for bosses and minibosses.",
      "id": 2
    },
    {
      "suggestion": "Material Names | <@402246856752627713> | 04 - 02 - 2021 | 3\n• Twisted Energy • Elemental Weave • Soul Essence • Soul Weave",
      "id": 3
    },
    {
      "suggestion": "Icicle Glaive | <@402246856752627713> | 04 - 02 - 2021 | 4\nA spear which shoots snow cave icicles when you attack.",
      "id": 4
    },
    {
      "suggestion": "Hemomancy Cleric | <@402246856752627713> | 04 - 02 - 2021 | 5\nA system where you collect blood from enemies via damaging them with melee weapons, and use that to empower your magic.",
      "id": 5
    },
    {
      "suggestion": "undefined | <@331912877340622858> | 04 - 02 - 2021 | 6\nundefined",
      "id": 6
    },
    {
      "suggestion": "Tomb stone | <@402246856752627713> | 04 - 02 - 2021 | 7\na placeable object that summons a zombie with slightly boosted stats to fight for you - Terry",
      "id": 7
    },
    {
      "suggestion": "undefined | <@331912877340622858> | 04 - 02 - 2021 | 8\nundefined",
      "id": 8
    },
    {
      "suggestion": "Grave Robber | <@117819195432894466> | 04 - 02 - 2021 | 9\nBoss gimmick that detects and gains a stacking buff from nearby tombstones. Punishes players who do not clean after their deaths. Maybe when spawned, it throws out a few generic tombstones. Bonus reward when killed with more Tombstone buffs, like players who want to scale their farming.",
      "id": 9
    },
    {
      "suggestion": "Hail Fire Spell | <@249328472265195521> | 06 - 02 - 2021 | 10\nshoots one large but slow projectile, and that fires a swarm of smaller projectiles, ends upon the main part hitting a enemy or wall",
      "id": 10
    },
    {
      "suggestion": "Pet Merchant | <@249328472265195521> | 06 - 02 - 2021 | 11\nNPC vendor who unlocks pet versions of bosses you defeat.  Hilarious when you start defeating archangels and old gods!",
      "id": 11
    },
    {
      "suggestion": "Pet Merchant | <@402246856752627713> | 06 - 02 - 2021 | 12\nNPC vendor who unlocks pet versions of bosses you defeat.  Hilarious when you start defeating archangels and old gods!",
      "id": 12
    },
    {
      "suggestion": "flailing flail | <@331912877340622858> | 06 - 02 - 2021 | 13\na flail with smaller flails",
      "id": 13
    },
    {
      "suggestion": "flail of flails | <@331912877340622858> | 06 - 02 - 2021 | 14\na flail with smaller flails at the end",
      "id": 14
    },
    {
      "suggestion": "Lore NPCs | <@117819195432894466> | 06 - 02 - 2021 | 15\nIn order to breathe more life into the lore, or existence of other races or kingdom reps, have some 'lesser NPCs' capable of joining up.  Instead of selling items, they could have extra dialogue options to casually talk about this topic or that.",
      "id": 15
    },
    {
      "suggestion": "Pet Merchant | <@117819195432894466> | 06 - 02 - 2021 | 16\nNPC vendor who unlocks pet versions of bosses you defeat.  Hilarious when you start defeating archangels and old gods!",
      "id": 16
    },
    {
      "suggestion": "library of swords | <@331912877340622858> | 06 - 02 - 2021 | 17\na channels magic spell that summons and shoots sword towards the cursor, could have higher lvl variants with nice and more swords",
      "id": 17
    },
    {
      "suggestion": "Party Popper Gun | <@117819195432894466> | 06 - 02 - 2021 | 18\nMore uses for the confetti graphic, possible to upgrade to a cannon if you want to risk it becoming a MLP ref. Possibly to cause Confusion to enemies, possibly to grant buffs to nearby allies.",
      "id": 18
    },
    {
      "suggestion": "party bomb | <@331912877340622858> | 06 - 02 - 2021 | 19\nit’s just a normal bomb but also has confetti",
      "id": 19
    },
    {
      "suggestion": "sawblade | <@331912877340622858> | 06 - 02 - 2021 | 20\na minion that’s the saw trap from the dungeon, just non hostile",
      "id": 20
    },
    {
      "suggestion": "PECK | <@117819195432894466> | 06 - 02 - 2021 | 21\nspell that deals a low damage multi-hit attack, low Mana, and zero cool down. Attack faster than you can click!",
      "id": 21
    },
    {
      "suggestion": "cape of snowfall | <@331912877340622858> | 06 - 02 - 2021 | 22\nallows a short dash with invulnerability where you turn into snow flakes",
      "id": 22
    },
    {
      "suggestion": "harpy’s yolk | <@331912877340622858> | 06 - 02 - 2021 | 23\nunder certain conditions ,perhaps like above a certain height, you turn into a harpy, ala werewolf and merfolk",
      "id": 23
    },
    {
      "suggestion": "grappler | <@331912877340622858> | 06 - 02 - 2021 | 24\na enemy who tries to grab and throw the player",
      "id": 24
    },
    {
      "suggestion": "Astral Bombardment | <@409768934196117504> | 06 - 02 - 2021 | 25\nBasically a spell which causes stuff from space to rain down on your enemies, costs a lot of mana but does a ton of damage",
      "id": 25
    },
    {
      "suggestion": "Music-based support | <@249328472265195521> | 06 - 02 - 2021 | 26\nLike a Bard or a Monster Hunter hunter with a Hunting Horn, you beat the crap out of enemies and do special supportive effects for you and your party depending on what you hit them with in which order",
      "id": 26
    },
    {
      "suggestion": "Tooltip Enhancement | <@402246856752627713> | 06 - 02 - 2021 | 27\nUse icons to our advantage when drawing Tooltips, to allow giving brief descriptions of long lists like debuff immunities",
      "id": 27
    },
    {
      "suggestion": "UI Enhancement | <@402246856752627713> | 06 - 02 - 2021 | 28\nUse icons to our advantage when enemies are afflicted with a debuff, allowing us to draw the icons of the debuffs they are inflicted with underneath their health bar to give players a brief summary of the debuffs they are afflicted with. Make this a toggleable feature",
      "id": 28
    },
    {
      "suggestion": "A new mage weapon | <@409768934196117504> | 06 - 02 - 2021 | 29\nshoots out a projectile that does damage to enemies and disappears when it comes into contact with enemies, however if it doesn't come into contact with an enemy, it will slowly return to the player, buffing them and restoring health",
      "id": 29
    },
    {
      "suggestion": "new spray fire gun | <@409768934196117504> | 06 - 02 - 2021 | 30\nthis gun sprays out bullets in a cone looking pattern. The longer you shoot, the cone shape gets smaller until it's just a precise line of bullets being fired. As the cone games smaller, damage and crit chances are increased",
      "id": 30
    },
    {
      "suggestion": "a fan | <@409768934196117504> | 06 - 02 - 2021 | 31\na fan item that players can hold and activate. Activating the fan while holding it will cause the player to slowly move backwards. I can't think of a practical use, but it could be an interesting and unique item",
      "id": 31
    },
    {
      "suggestion": "Druid circle spell | <@331912877340622858> | 06 - 02 - 2021 | 32\nhas the Druids circle but if a friend gets hurt it heals, and if a enemy enters the circle it gets hurt, high mana upkeep, but strong",
      "id": 32
    },
    {
      "suggestion": "more useful mounts | <@409768934196117504> | 06 - 02 - 2021 | 33\nmounts that have weapons. Not meant to be something to fight bosses with but just making getting around the world a bit easier. It could be anything from a dragon that breaths fire to a mech with lazers",
      "id": 33
    },
    {
      "suggestion": "Blueprint Mode | <@409768934196117504> | 06 - 02 - 2021 | 34\nA way to place down \"blueprint blocks\" which allow you to plan out your builds before fully making them, a lot like the blueprints in factorio in a way but not really",
      "id": 34
    },
    {
      "suggestion": "coolicorm | <@331912877340622858> | 06 - 02 - 2021 | 35\nit’s a unicorn with a cigar sunglasses, and a chain gun on its side, and when mounted it auto fires at things in front of it for okayish damage",
      "id": 35
    },
    {
      "suggestion": "Vampiric Weapons | <@409768934196117504> | 06 - 02 - 2021 | 36\nAlt title, blood weapons. Basically a vampire knives equivalent for each class. A sword that heals, a spell that heals, a gun that heals *cough* red death *cough*, etc",
      "id": 36
    },
    {
      "suggestion": "vampires fang | <@331912877340622858> | 06 - 02 - 2021 | 37\naccessory, gives low power version of vampire knife life steal",
      "id": 37
    },
    {
      "suggestion": "can of energy drink | <@409768934196117504> | 06 - 02 - 2021 | 38\nthis accessory gives you a speed boost as long as you have it equipped, designed to be found in wooden chests during early prehardmode",
      "id": 38
    },
    {
      "suggestion": "boink nuclear drink | <@331912877340622858> | 06 - 02 - 2021 | 39\ndoubles damage you do, but could double or triple damage taken",
      "id": 39
    },
    {
      "suggestion": "Bounty/NPC giver | <@409768934196117504> | 06 - 02 - 2021 | 40\nAdds bounties, short fetch quests, for each NPC. They reset in-game daily and give varying rewards based on the difficulty of the quest. As more NPCs are unlocked, the earlier NPCs also get new quests. This'll just be to make sure that players won't completely ignore the earlier NPCs in lategame. There could be a vendor that tracks how many you've done and depending on how many you've done, his inventory of items to sell will get bigger and bigger.",
      "id": 40
    },
    {
      "suggestion": "fisher vendor | <@331912877340622858> | 06 - 02 - 2021 | 41\nhave a way to get some more rng fishing g rewards also be able to be bought for crazy high rates",
      "id": 41
    },
    {
      "suggestion": "Blood Vial | <@402246856752627713> | 08 - 02 - 2021 | 42\nBlood potions, potentially to restore Blood for Blood Clerics in the same way that Mana potions restore Mana for Mages. Inflicts Blood Sickness",
      "id": 42
    },
    {
      "suggestion": "blood | <@331912877340622858> | 08 - 02 - 2021 | 43\na liquid faster than lava, slower than water, could give regen to so,e monsters",
      "id": 43
    },
    {
      "suggestion": "Material | <@402246856752627713> | 08 - 02 - 2021 | 44\nSilk combined with Fallen Stars at a Starloom make Starfiber. Starfiber combined with one of each soul at a hardmode anvil makes Soulweave",
      "id": 44
    },
    {
      "suggestion": "Elemental Display | <@402246856752627713> | 08 - 02 - 2021 | 45\nShow the elemental types of enemies next to or underneath their health bars, or on mouseover next to their name.",
      "id": 45
    },
    {
      "suggestion": "sippy cup potions | <@331912877340622858> | 08 - 02 - 2021 | 46\na joke item that restores less than the default potions",
      "id": 46
    },
    {
      "suggestion": "mercury rain | <@331912877340622858> | 08 - 02 - 2021 | 47\nkinda like golden shower but less cringe and more melting flesh, I think it does that?",
      "id": 47
    },
    {
      "suggestion": "Trials Of Lysanderia | <@409768934196117504> | 12 - 02 - 2021 | 48\nI can't remember how to spell her name. An ultra hardcore mode, not sure how we could flesh it out and make it unique tho",
      "id": 48
    },
    {
      "suggestion": "risk of rockets | <@331912877340622858> | 12 - 02 - 2021 | 49\na accessory that which each attack has a chance to span a missile that seeks and damages a enemy, kinda like the risk of rain missile launcher",
      "id": 49
    },
    {
      "suggestion": "Catastrophe Mode | <@117819195432894466> | 12 - 02 - 2021 | 50\nA scroll that gives a temp effect to add a bunch zeros to the displayed damage numbers dealt and received. Cosmetic.",
      "id": 50
    },
    {
      "suggestion": "spitter slime | <@331912877340622858> | 12 - 02 - 2021 | 51\nit spits a glob of slime and if it misses, a normal slime spawns, the spitter is pretty immobile",
      "id": 51
    }
  ]
}